{"format": "layers-model", "generatedBy": "keras v2.0.2", "convertedBy": "TensorFlow.js Converter v1.0.1", "modelTopology": {"keras_version": "2.0.2", "backend": "tensorflow", "model_config": {"class_name": "Sequential", "config": [{"class_name": "Conv2D", "config": {"trainable": true, "activity_regularizer": null, "bias_regularizer": null, "dtype": "float32", "strides": [1, 1], "filters": 32, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "bias_constraint": null, "kernel_size": [3, 3], "name": "conv2d_11", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "kernel_constraint": null, "dilation_rate": [1, 1], "batch_input_shape": [null, 224, 224, 3], "data_format": "channels_last", "padding": "same", "activation": "relu"}}, {"class_name": "MaxPooling2D", "config": {"trainable": true, "strides": [2, 2], "name": "max_pooling2d_10", "data_format": "channels_last", "pool_size": [2, 2], "padding": "valid"}}, {"class_name": "Conv2D", "config": {"trainable": true, "activity_regularizer": null, "bias_regularizer": null, "activation": "relu", "strides": [1, 1], "filters": 32, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "bias_constraint": null, "kernel_size": [3, 3], "name": "conv2d_12", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "kernel_constraint": null, "dilation_rate": [1, 1], "data_format": "channels_last", "padding": "same"}}, {"class_name": "MaxPooling2D", "config": {"trainable": true, "strides": [2, 2], "name": "max_pooling2d_11", "data_format": "channels_last", "pool_size": [2, 2], "padding": "valid"}}, {"class_name": "Conv2D", "config": {"trainable": true, "activity_regularizer": null, "bias_regularizer": null, "activation": "relu", "strides": [1, 1], "filters": 64, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "bias_constraint": null, "kernel_size": [3, 3], "name": "conv2d_13", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "kernel_constraint": null, "dilation_rate": [1, 1], "data_format": "channels_last", "padding": "same"}}, {"class_name": "MaxPooling2D", "config": {"trainable": true, "strides": [2, 2], "name": "max_pooling2d_12", "data_format": "channels_last", "pool_size": [2, 2], "padding": "valid"}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_5"}}, {"class_name": "Dense", "config": {"trainable": true, "activity_regularizer": null, "bias_regularizer": null, "activation": "relu", "units": 64, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "use_bias": true, "bias_constraint": null, "name": "dense_7", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "kernel_constraint": null}}, {"class_name": "Dropout", "config": {"trainable": true, "rate": 0.5, "name": "dropout_3"}}, {"class_name": "Dense", "config": {"trainable": true, "activity_regularizer": null, "bias_regularizer": null, "activation": "softmax", "units": 133, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "use_bias": true, "bias_constraint": null, "name": "dense_8", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "kernel_constraint": null}}]}, "training_config": {"sample_weight_mode": null, "optimizer_config": {"class_name": "RMSprop", "config": {"rho": 0.8999999761581421, "lr": 0.0010000000474974513, "decay": 0.0, "epsilon": 1e-08}}, "metrics": ["accuracy"], "loss_weights": null, "loss": "categorical_crossentropy"}}, "weightsManifest": [{"paths": ["group1-shard1of4.bin", "group1-shard2of4.bin", "group1-shard3of4.bin", "group1-shard4of4.bin"], "weights": [{"name": "conv2d_11/kernel", "shape": [3, 3, 3, 32], "dtype": "float32"}, {"name": "conv2d_11/bias", "shape": [32], "dtype": "float32"}, {"name": "conv2d_12/kernel", "shape": [3, 3, 32, 32], "dtype": "float32"}, {"name": "conv2d_12/bias", "shape": [32], "dtype": "float32"}, {"name": "conv2d_13/kernel", "shape": [3, 3, 32, 64], "dtype": "float32"}, {"name": "conv2d_13/bias", "shape": [64], "dtype": "float32"}, {"name": "dense_7/kernel", "shape": [50176, 64], "dtype": "float32"}, {"name": "dense_7/bias", "shape": [64], "dtype": "float32"}, {"name": "dense_8/kernel", "shape": [64, 133], "dtype": "float32"}, {"name": "dense_8/bias", "shape": [133], "dtype": "float32"}]}]}